# 1. 신입 데이터 분석가를 위한 실전 미션!

< 주어지는 데이터 >
1. 고객 정보 (직접 생성)
    - customer_id : 101, 102, 103, 104, 105, 106
    - name : 'Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'
    - age : 25,32,45,38,29,41
2. 구매 내역
    - order_history 데이터셋으로 가져오기

< 요구 사항 >
1. 구매 데이터의 price 컬럼에 있는 결측치는 전체 상품의 "평균 가격"으로 채우시오.
2. price가 1000을 초과하는 데이터는 이상치로 간주하고, 전체 상품의 "중앙값"으로 대체하시오.
3. 정제된 두 데이터프레임을 customer_id 기준으로 병합하시오.
4. 최종 병합된 데이터프레임에 대한 기술 통계량을 도출하시오.

In [4]:
import numpy as np
from pandas import DataFrame
from hossam import load_data
from pandas import merge
from sklearn.impute import SimpleImputer

In [2]:
customer_info={'customer_id':[101,102,103,104,105,106],'name':['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],'age':[25,32,45,38,29,41]}
df=DataFrame(customer_info)
df

   customer_id     name  age
0          101    Alice   25
1          102      Bob   32
2          103  Charlie   45
3          104    David   38
4          105      Eve   29
5          106    Frank   41

In [13]:
origin=load_data('order_history')
origin

[data] https://data.hossam.kr/data/lab04/order_history.xlsx
[desc] 신입 데이터 분석가를 위한 실전 미션!

field        description
-----------  -------------
purchase_id  일련번호
customer_id  고객번호
item         상품명
price        금액

             customer_id             item   price
purchase_id
1                    101           Laptop  1200.0
2                    102            Mouse    25.0
3                    103         Keyboard     NaN
4                    101          Monitor   300.0
5                    104           Webcam  5000.0
6                    102          USB Hub    30.0
7                    105           Laptop  1100.0
8                    103            Mouse     NaN
9                    101     External HDD    80.0
10                   106  Docking Station   150.0

In [21]:
imr=SimpleImputer(missing_values=np.nan, strategy='mean')
df_reshape=origin['price'].values.reshape(-1,1)
df_imr=imr.fit_transform(df_reshape)
hello_df=origin.copy()
hello_df['price']=df_imr
hello_df

             customer_id             item     price
purchase_id
1                    101           Laptop  1200.000
2                    102            Mouse    25.000
3                    103         Keyboard   985.625
4                    101          Monitor   300.000
5                    104           Webcam  5000.000
6                    102          USB Hub    30.000
7                    105           Laptop  1100.000
8                    103            Mouse   985.625
9                    101     External HDD    80.000
10                   106  Docking Station   150.000

In [23]:
hello_df.loc[hello_df['price']>1000,'price']=np.nan
imr=SimpleImputer(missing_values=np.nan, strategy='median')
df_reshape_1=hello_df['price'].values.reshape(-1,1)
df_imr=imr.fit_transform(df_reshape_1)
my_df=hello_df.copy()
my_df['price']=df_imr
my_df

             customer_id             item    price
purchase_id
1                    101           Laptop  150.000
2                    102            Mouse   25.000
3                    103         Keyboard  985.625
4                    101          Monitor  300.000
5                    104           Webcam  150.000
6                    102          USB Hub   30.000
7                    105           Laptop  150.000
8                    103            Mouse  985.625
9                    101     External HDD   80.000
10                   106  Docking Station  150.000

In [24]:
df_final=merge(df, my_df, on='customer_id')
df_final

   customer_id     name  age             item    price
0          101    Alice   25           Laptop  150.000
1          101    Alice   25          Monitor  300.000
2          101    Alice   25     External HDD   80.000
3          102      Bob   32            Mouse   25.000
4          102      Bob   32          USB Hub   30.000
5          103  Charlie   45         Keyboard  985.625
6          103  Charlie   45            Mouse  985.625
7          104    David   38           Webcam  150.000
8          105      Eve   29           Laptop  150.000
9          106    Frank   41  Docking Station  150.000

In [25]:
df_final.describe()

       customer_id       age       price
count     10.00000  10.00000   10.000000
mean     102.80000  33.70000  300.625000
std        1.75119   8.04225  369.246135
min      101.00000  25.00000   25.000000
25%      101.25000  26.00000   97.500000
50%      102.50000  32.00000  150.000000
75%      103.75000  40.25000  262.500000
max      106.00000  45.00000  985.625000